// Տրված են a և b բնական թվերը: Արտածել YES, եթե
// ա) դրանք երկուսն էլ կենտ են,
//  բ) դրանցից գոնե մեկը կենտ է,
// գ) դրանցից ճիշտ մեկը կենտ է,
// դ) դրանք երկուսն էլ կենտ են կամ երկուսն էլ զույգ:
// Հակառակ դեպքում արտածել NO:




// function kent_tver(a, b){
//     if(a % 2 !== 0  || b % 2 !== 0 ){
//         console.log("Yes");
//     }else if(a % 2 === 0  && b % 2 === 0 ){
//         console.log("Yes");
//     }else{
//         console.log("No")
//     }
// }
// kent_tver(10, 5 );



