// Տրված են a և b բնական թվերը: Արտածել YES, եթե
// ա) դրանք երկուսն էլ կենտ են,
//  բ) դրանցից գոնե մեկը կենտ է,
// գ) դրանցից ճիշտ մեկը կենտ է,
// դ) դրանք երկուսն էլ կենտ են կամ երկուսն էլ զույգ:
// Հակառակ դեպքում արտածել NO:




// function kent_tver(a, b){
//     if(a % 2 !== 0  || b % 2 !== 0 ){
//         console.log("Yes");
//     }else if(a % 2 === 0  && b % 2 === 0 ){
//         console.log("Yes");
//     }else{
//         console.log("No")
//     }
// }
// kent_tver(10, 5 );




// 2. Տրված են a, b և c ամբողջ թվերը: Արտածել YES, եթե դրանցից

// ա) գոնե մեկը զրո է,
// բ) ճիշտ մեկը հինգ է,
// ոչ մեկը մյուսներին հավասար չէ,
// ճիշտ երկուսն են հավասար,
// բոլոր երեքն իրար հավասար են,
// գոնե մեկը բացասական է


// ա) գոնե մեկը զրո է,
// բ) ճիշտ մեկը հինգ է,


// function amboxj_tver(a, b, c){
//        if(a === 0 || a === 5 || b === 0 || b === 5 || c === 0 || c === 5  ){
//         console.log("Yes");
//        } else{
//         console.log("Noo")
//        }
// }
// amboxj_tver(7, 9, 8);

// ոչ մեկը մյուսներին հավասար չէ,

// function amboxj_tver(a, b, c){
//        if(a !== b && b !== c && a !== c){
//         console.log("Yes");
//        } else{
//         console.log("Noo")
//        }
//        // ճիշտ երկուսն են հավասար,
//        if((a === b && a !== c) || ( a === c && a !== b) || ( b === c && b !== a)){
//         console.log("Yes")
//        }else{ 
//          console.log("No") 
//        }
// // բոլոր երեքն իրար հավասար են,
//        if(a === b && a === c && b === c){
//         console.log("Yes");
//        }else{
//         console.log("No")
//        }
// // գոնե մեկը բացասական է
//        if(a <  0 || b < 0 || c < 0){
//         console.log("Yes");
//        }else{
//         console.log("No")
//        }
       
// }
// amboxj_tver(-4, 9, 7);






